Ran Plan for project: `nas.techtales.io` dir: `terraform/nas.techtales.io` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
- destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.bucket_policies["policy_alex_backup"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:GetObject",
+               "s3:ListBucket",
            ]
+           resources = [
+               "arn:aws:s3:::backup/*",
            ]
        }
+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::backup/alex/*",
            ]
        }
    }

  # module.bucket_policies["policy_cnpg-kube-lab_cnpg"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::cnpg/kube-lab/*",
            ]
        }
    }

  # module.bucket_policies["policy_cnpg-nas_cnpg"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::cnpg/nas/*",
            ]
        }
    }

  # module.bucket_policies["policy_dominik_backup"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:GetObject",
+               "s3:ListBucket",
            ]
+           resources = [
+               "arn:aws:s3:::backup/*",
            ]
        }
+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::backup/dominik/*",
            ]
        }
    }

  # module.bucket_policies["policy_jasmin_backup"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:GetObject",
+               "s3:ListBucket",
            ]
+           resources = [
+               "arn:aws:s3:::backup/*",
            ]
        }
+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::backup/jasmin/*",
            ]
        }
    }

  # module.bucket_policies["policy_nils_backup"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:GetObject",
+               "s3:ListBucket",
            ]
+           resources = [
+               "arn:aws:s3:::backup/*",
            ]
        }
+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::backup/nils/*",
            ]
        }
    }

  # module.bucket_policies["policy_terraform-discord_terraform"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::terraform/discord/*",
            ]
        }
    }

  # module.bucket_policies["policy_terraform-gcloud_terraform"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::terraform/gcloud/*",
            ]
        }
    }

  # module.bucket_policies["policy_terraform-github_terraform"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::terraform/github/techtales-io/*",
            ]
        }
    }

  # module.bucket_policies["policy_terraform-gworkspace_terraform"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::terraform/gworkspace/*",
            ]
        }
    }

  # module.bucket_policies["policy_terraform-minio_terraform"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::terraform/minio/nas.techtales.io/*",
            ]
        }
    }

  # module.bucket_policies["policy_terraform-openbao_terraform"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:GetObject",
+               "s3:ListBucket",
            ]
+           resources = [
+               "arn:aws:s3:::terraform/*",
            ]
        }
+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::terraform/openbao/*",
            ]
        }
    }

  # module.bucket_policies["policy_tyriis-terraform-github_terraform"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::terraform/github/tyriis/*",
            ]
        }
    }

  # module.bucket_policies["policy_volsync-kube-lab-bazar-config_volsync"].minio_iam_policy.main will be destroyed
  # (because module.bucket_policies["policy_volsync-kube-lab-bazar-config_volsync"] is not in configuration)
- resource "minio_iam_policy" "main" {
-       id     = "volsync-kube-lab-bazar-config-volsync" -> null
-       name   = "volsync-kube-lab-bazar-config-volsync" -> null
-       policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = [
-                           "s3:*",
                        ]
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:s3:::volsync/kube-lab/media/bazar-config/*",
                        ]
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> null
    }

  # module.bucket_policies["policy_volsync-kube-lab-bazar-config_volsync"].minio_iam_user_policy_attachment.main will be destroyed
  # (because module.bucket_policies["policy_volsync-kube-lab-bazar-config_volsync"] is not in configuration)
- resource "minio_iam_user_policy_attachment" "main" {
-       id          = "volsync-kube-lab-bazar-config-20260101232840516900000001" -> null
-       policy_name = "volsync-kube-lab-bazar-config-volsync" -> null
-       user_name   = "volsync-kube-lab-bazar-config" -> null
    }

  # module.bucket_policies["policy_volsync-kube-lab-bazarr-config_volsync"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/kube-lab/media/bazarr-config/*",
            ]
        }
    }

  # module.bucket_policies["policy_volsync-kube-lab-bazarr-config_volsync"].minio_iam_policy.main will be created
+ resource "minio_iam_policy" "main" {
+       id     = (known after apply)
+       name   = "volsync-kube-lab-bazarr-config-volsync"
+       policy = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "s3:*",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::volsync/kube-lab/media/bazarr-config/*",
                        ]
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
    }

  # module.bucket_policies["policy_volsync-kube-lab-bazarr-config_volsync"].minio_iam_user_policy_attachment.main will be created
+ resource "minio_iam_user_policy_attachment" "main" {
+       id          = (known after apply)
+       policy_name = "volsync-kube-lab-bazarr-config-volsync"
+       user_name   = "volsync-kube-lab-bazarr-config"
    }

  # module.bucket_policies["policy_volsync-kube-lab_volsync"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/kube-lab/*",
            ]
        }
    }

  # module.bucket_policies["policy_volsync-nas_volsync"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/nas/*",
            ]
        }
    }

  # module.users["volsync-kube-lab-bazar-config"].minio_iam_user.main will be destroyed
  # (because module.users["volsync-kube-lab-bazar-config"] is not in configuration)
- resource "minio_iam_user" "main" {
-       disable_user  = false -> null
-       force_destroy = false -> null
-       id            = "volsync-kube-lab-bazar-config" -> null
-       name          = "volsync-kube-lab-bazar-config" -> null
-       secret        = (sensitive value) -> null
-       status        = "enabled" -> null
-       tags          = {
-           "managed-by" = "terraform"
        } -> null
-       update_secret = false -> null
    }

  # module.users["volsync-kube-lab-bazar-config"].vault_generic_secret.minio_secret will be destroyed
  # (because module.users["volsync-kube-lab-bazar-config"] is not in configuration)
- resource "vault_generic_secret" "minio_secret" {
-       data                = (sensitive value) -> null
-       data_json           = (sensitive value) -> null
-       delete_all_versions = false -> null
-       disable_read        = false -> null
-       id                  = "infra/minio/iam/nas.techtales.io/volsync-kube-lab-bazar-config" -> null
-       path                = "infra/minio/iam/nas.techtales.io/volsync-kube-lab-bazar-config" -> null
    }

  # module.users["volsync-kube-lab-bazarr-config"].minio_iam_user.main will be created
+ resource "minio_iam_user" "main" {
+       disable_user  = false
+       force_destroy = false
+       id            = (known after apply)
+       name          = "volsync-kube-lab-bazarr-config"
+       secret        = (sensitive value)
+       status        = (known after apply)
+       tags          = {
+           "managed-by" = "terraform"
        }
+       update_secret = false
    }

  # module.users["volsync-kube-lab-bazarr-config"].vault_generic_secret.minio_secret will be created
+ resource "vault_generic_secret" "minio_secret" {
+       data                = (sensitive value)
+       data_json           = (sensitive value)
+       delete_all_versions = false
+       disable_read        = false
+       id                  = (known after apply)
+       path                = "infra/minio/iam/nas.techtales.io/volsync-kube-lab-bazarr-config"
    }

Plan: 4 to add, 0 to change, 4 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p nas.techtales.io
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis-techtales-io-terraform-minio.techtales.io/lock?id=techtales-io%252Fterraform-minio%252Fterraform%252Fnas.techtales.io%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p nas.techtales.io
  ```
Plan: 4 to add, 0 to change, 4 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```